<img src="https://8weeksqlchallenge.com/images/case-study-designs/1.png" width="800" height="800">

`Introduction`

Danny seriously loves Japanese food so in the beginning of 2021, he decides to embark upon a risky venture and opens up a cute little restaurant that sells his 3 favourite foods: sushi, curry and ramen.

Danny’s Diner is in need of your assistance to help the restaurant stay afloat - the restaurant has captured some very basic data from their few months of operation but have no idea how to use their data to help them run the business.

`Problem Statement`

Danny wants to use the data to answer a few simple questions about his customers, especially about their visiting patterns, how much money they’ve spent and also which menu items are their favourite. Having this deeper connection with his customers will help him deliver a better and more personalised experience for his loyal customers.

He plans on using these insights to help him decide whether he should expand the existing customer loyalty program - additionally he needs help to generate some basic datasets so his team can easily inspect the data without needing to use SQL.

We have a sample of the restuarent's customer data due to privacy issues. The three key datasets we have are 
- sales
- menu
- members

All the datasets exists within the `dannys_diner` database schema

### Database & Dataset Creation

In [1]:
%load_ext sql
%sql mysql://root:root@localhost:3306/

In [2]:
%%sql
CREATE SCHEMA dannys_diner

 * mysql://root:***@localhost:3306/
1 rows affected.

[]

In [3]:
%%sql
use dannys_diner

 * mysql://root:***@localhost:3306/
0 rows affected.

[]

In [4]:
%%sql
CREATE TABLE `sales` (
  `customer_id` VARCHAR(1),
  `order_date` DATE,
  `product_id` INTEGER
);

 * mysql://root:***@localhost:3306/
0 rows affected.

[]

In [5]:
%%sql
INSERT INTO `sales`
  (`customer_id`, `order_date`, `product_id`)
VALUES
  ('A', '2021-01-01', '1'),
  ('A', '2021-01-01', '2'),
  ('A', '2021-01-07', '2'),
  ('A', '2021-01-10', '3'),
  ('A', '2021-01-11', '3'),
  ('A', '2021-01-11', '3'),
  ('B', '2021-01-01', '2'),
  ('B', '2021-01-02', '2'),
  ('B', '2021-01-04', '1'),
  ('B', '2021-01-11', '1'),
  ('B', '2021-01-16', '3'),
  ('B', '2021-02-01', '3'),
  ('C', '2021-01-01', '3'),
  ('C', '2021-01-01', '3'),
  ('C', '2021-01-07', '3');

 * mysql://root:***@localhost:3306/
15 rows affected.

[]

In [6]:
%%sql
CREATE TABLE `menu` (
  `product_id` INTEGER,
  `product_name` VARCHAR(5),
  `price` INTEGER
);

 * mysql://root:***@localhost:3306/
0 rows affected.

[]

In [7]:
%%sql
INSERT INTO `menu`
  (`product_id`, `product_name`, `price`)
VALUES
  ('1', 'sushi', '10'),
  ('2', 'curry', '15'),
  ('3', 'ramen', '12');

 * mysql://root:***@localhost:3306/
3 rows affected.

[]

In [8]:
%%sql
CREATE TABLE `members` (
  `customer_id` VARCHAR(1),
  `join_date` DATE
);

 * mysql://root:***@localhost:3306/
0 rows affected.

[]

In [9]:
%%sql
INSERT INTO `members`
  (`customer_id`, `join_date`)
VALUES
  ('A', '2021-01-07'),
  ('B', '2021-01-09');

 * mysql://root:***@localhost:3306/
2 rows affected.

[]

### Case Study Questiions

1. What is the total amount each customer spent at the restaurant?
2. How many days has each customer visited the restaurant?
3. What was the first item from the menu purchased by each customer?
4. What is the most purchased item on the menu and how many times was it purchased by all customers?
5. Which item was the most popular for each customer?
6. Which item was purchased first by the customer after they became a member?
7. Which item was purchased just before the customer became a member?
8. What is the total items and amount spent for each member before they became a member?
9. If each $1 spent equates to 10 points and sushi has a 2x points multiplier - how many points would each customer have?
10. In the first week after a customer joins the program (including their join date) they earn 2x points on all items, not just sushi - how many points do customer A and B have at the end of January?

In [10]:
%%sql
# members table
select * from members
limit 5;

 * mysql://root:***@localhost:3306/
2 rows affected.

[('A', datetime.date(2021, 1, 7)), ('B', datetime.date(2021, 1, 9))]

In [11]:
%%sql
# menu table
select * from menu
limit 5;

 * mysql://root:***@localhost:3306/
3 rows affected.

[(1, 'sushi', 10), (2, 'curry', 15), (3, 'ramen', 12)]

In [12]:
%%sql
# sales table
select * from sales
limit 5;

 * mysql://root:***@localhost:3306/
5 rows affected.

[('A', datetime.date(2021, 1, 1), 1),
 ('A', datetime.date(2021, 1, 1), 2),
 ('A', datetime.date(2021, 1, 7), 2),
 ('A', datetime.date(2021, 1, 10), 3),
 ('A', datetime.date(2021, 1, 11), 3)]

**Question 1**:
What is the total amount each customer spent at the restaurant?

In [13]:
%%sql
select customer_id, sum(price) as amount_spent
from sales
join menu
using(product_id)
group by customer_id

 * mysql://root:***@localhost:3306/
3 rows affected.

[('A', Decimal('76')), ('B', Decimal('74')), ('C', Decimal('36'))]

**Question 2**:
How many days has each customer visited the restaurant?

In [14]:
%%sql
select customer_id, count(distinct order_date) as number_of_days
from sales
group by customer_id

 * mysql://root:***@localhost:3306/
3 rows affected.

[('A', 4), ('B', 6), ('C', 2)]

**Question 3**: What was the first item from the menu purchased by each customer?

In [15]:
%%sql
with cte1 as (select customer_id, product_id, row_number() over(partition by customer_id order by order_date) as rnk
from sales)
select customer_id, product_name
from cte1
join menu
using(product_id)
where rnk=1

 * mysql://root:***@localhost:3306/
3 rows affected.

[('A', 'sushi'), ('B', 'curry'), ('C', 'ramen')]

**Question 4**: What is the most purchased item on the menu and how many times was it purchased by all customers?

In [16]:
%%sql
select product_name, count(*) as total_times
from sales
join menu
group by 1
order by 2 desc
limit 1

 * mysql://root:***@localhost:3306/
1 rows affected.

[('ramen', 15)]

**Question 5**: Which item was the most popular for each customer?

In [17]:
%%sql
with cte1 as (select customer_id, product_id, dense_rank() over(partition by customer_id order by count(*) desc) as rnk
from sales
group by 1,2
order by 1,2)

select customer_id, product_name
from cte1
join menu
using(product_id)
where rnk=1
order by 1

 * mysql://root:***@localhost:3306/
5 rows affected.

[('A', 'ramen'),
 ('B', 'sushi'),
 ('B', 'curry'),
 ('B', 'ramen'),
 ('C', 'ramen')]

**Question 6**: Which item was purchased first by the customer after they became a member?

In [18]:
%%sql

with cte1 as (select customer_id, min(order_date) as date
from 
sales
join members
using(customer_id)
group by 1)

select customer_id, group_concat(product_name separator ', ') as product_ordered
from sales
join cte1
using(customer_id)
join menu
using(product_id)
where date=order_date
group by 1

 * mysql://root:***@localhost:3306/
2 rows affected.

[('A', 'sushi, curry'), ('B', 'curry')]

**Question 7**: Which item was purchased just before the customer became a member?

In [19]:
%%sql

with cte1 as (select customer_id, product_id, 
dense_rank() over(partition by customer_id order by (case when datediff(order_date,join_date)>=0 then 0 else datediff(order_date,join_date) end) desc) as diff
from sales
join members
using(customer_id)
order by customer_id)

select customer_id, group_concat(product_name separator ', ') as products_ordered
from cte1
join menu
using(product_id)
where diff=2
group by 1

 * mysql://root:***@localhost:3306/
2 rows affected.

[('A', 'sushi, curry'), ('B', 'sushi')]

**Question 8**: What is the total items and amount spent for each member before they became a member?

In [20]:
%%sql

select customer_id, count(*) as total_items, sum(price) as total_amount
from sales
join members
using(customer_id)
join menu
using(product_id)
where join_date>order_date
group by 1
order by 1

 * mysql://root:***@localhost:3306/
2 rows affected.

[('A', 2, Decimal('25')), ('B', 3, Decimal('40'))]

**Question 9**: If each $1 spent equates to 10 points and sushi has a 2x points multiplier - how many points would each customer have?

In [21]:
%%sql

select customer_id, sum(case when product_name='sushi' then price*20 else price*10 end) as total_pts
from sales
join menu
using(product_id)
group by 1
order by 1

 * mysql://root:***@localhost:3306/
3 rows affected.

[('A', Decimal('860')), ('B', Decimal('940')), ('C', Decimal('360'))]

**Question 10**: In the first week after a customer joins the program (including their join date) they earn 2x points on all items, not just sushi - how many points do customer A and B have at the end of January?

In [22]:
%%sql

select customer_id, sum(case when datediff(order_date,join_date)<7 and datediff(order_date, join_date)>=0 then price*20 else price*10 end) as points
from sales
join members
using(customer_id)
join menu
using(product_id)
group by 1
order by 1

 * mysql://root:***@localhost:3306/
2 rows affected.

[('A', Decimal('1270')), ('B', Decimal('840'))]

### Bonus Questions

**Question 1**: Join All The Things

The following questions are related creating basic data tables that Danny and his team can use to quickly derive insights without needing to join the underlying tables using SQL.

Recreate the following table output using the available data:

| customer_id | order_date | product_name | price | member |
| --- | --- | --- | --- | --- |
| A | 2021-01-01 | curry | 15 | N |
| A | 2021-01-07 | curry | 15 | Y |

In [23]:
%%sql

select customer_id, order_date, product_name, price,
    case when datediff(order_date, join_date)>=0 then 'Y' else 'N' end as member
from sales
join menu
using(product_id)
left join members
using(customer_id)
order by 1, 2

 * mysql://root:***@localhost:3306/
15 rows affected.

[('A', datetime.date(2021, 1, 1), 'sushi', 10, 'N'),
 ('A', datetime.date(2021, 1, 1), 'curry', 15, 'N'),
 ('A', datetime.date(2021, 1, 7), 'curry', 15, 'Y'),
 ('A', datetime.date(2021, 1, 10), 'ramen', 12, 'Y'),
 ('A', datetime.date(2021, 1, 11), 'ramen', 12, 'Y'),
 ('A', datetime.date(2021, 1, 11), 'ramen', 12, 'Y'),
 ('B', datetime.date(2021, 1, 1), 'curry', 15, 'N'),
 ('B', datetime.date(2021, 1, 2), 'curry', 15, 'N'),
 ('B', datetime.date(2021, 1, 4), 'sushi', 10, 'N'),
 ('B', datetime.date(2021, 1, 11), 'sushi', 10, 'Y'),
 ('B', datetime.date(2021, 1, 16), 'ramen', 12, 'Y'),
 ('B', datetime.date(2021, 2, 1), 'ramen', 12, 'Y'),
 ('C', datetime.date(2021, 1, 1), 'ramen', 12, 'N'),
 ('C', datetime.date(2021, 1, 1), 'ramen', 12, 'N'),
 ('C', datetime.date(2021, 1, 7), 'ramen', 12, 'N')]

**Question 2**: Rank All The Things

Danny also requires further information about the ranking of customer products, but he purposely does not need the ranking for non-member purchases so he expects null ranking values for the records when customers are not yet part of the loyalty program.


| customer_id | order_date | product_name | price | member | ranking |
| --- | --- | --- | --- | --- | --- |
| A | 2021-01-01 | curry | 15 | N | null |
| A | 2021-01-07 | curry | 15 | Y | 1 |

In [24]:
%%sql

with cte1 as (select customer_id, order_date, product_name, price,
    case when datediff(order_date, join_date)>=0 then 'Y' else 'N' end as member
from sales
join menu
using(product_id)
left join members
using(customer_id)
order by 1, 2)

select *, case when member='N' then 'null'
    else dense_rank() over(partition by customer_id, member order by order_date) end as ranking
from cte1

 * mysql://root:***@localhost:3306/
15 rows affected.

[('A', datetime.date(2021, 1, 1), 'sushi', 10, 'N', 'null'),
 ('A', datetime.date(2021, 1, 1), 'curry', 15, 'N', 'null'),
 ('A', datetime.date(2021, 1, 7), 'curry', 15, 'Y', '1'),
 ('A', datetime.date(2021, 1, 10), 'ramen', 12, 'Y', '2'),
 ('A', datetime.date(2021, 1, 11), 'ramen', 12, 'Y', '3'),
 ('A', datetime.date(2021, 1, 11), 'ramen', 12, 'Y', '3'),
 ('B', datetime.date(2021, 1, 1), 'curry', 15, 'N', 'null'),
 ('B', datetime.date(2021, 1, 2), 'curry', 15, 'N', 'null'),
 ('B', datetime.date(2021, 1, 4), 'sushi', 10, 'N', 'null'),
 ('B', datetime.date(2021, 1, 11), 'sushi', 10, 'Y', '1'),
 ('B', datetime.date(2021, 1, 16), 'ramen', 12, 'Y', '2'),
 ('B', datetime.date(2021, 2, 1), 'ramen', 12, 'Y', '3'),
 ('C', datetime.date(2021, 1, 1), 'ramen', 12, 'N', 'null'),
 ('C', datetime.date(2021, 1, 1), 'ramen', 12, 'N', 'null'),
 ('C', datetime.date(2021, 1, 7), 'ramen', 12, 'N', 'null')]